/**
 * @file config.js
 * @description ملف الإعدادات والثوابت للمشروع.
 * يحتوي هذا الملف على القيم الثابتة التي تستخدم في جميع أنحاء التطبيق، مثل معرفات المسؤولين (Admins).
 * الغرض منه هو تجميع الإعدادات في مكان واحد لسهولة التعديل والإدارة.
 */

/**
 * @constant {string[]} ADMIN_IDS
 * @description قائمة معرفات المستخدمين الذين يمتلكون صلاحيات المسؤول (Admin).
 * يتم استخدام هذه القائمة للتحقق مما إذا كان المستخدم الحالي مسؤولاً أم لا.
 * @example
 * // للتحقق مما إذا كان المستخدم admin:
 * if (ADMIN_IDS.includes(userId)) { ... }
 */
export const ADMIN_IDS = ["xx1", "xx2"];
